$(() => {
    $("li#notebook>ol").html("V4.0更新日志（2025年4月20日）：<br>1、模块【发牌器】正式上线<br>2、手册版型新增《12人票房危机》《12人快递速运》和《12人无目之夜》<br>3、身份说明追加【票型少年】、【黑票法师】、【快递员】、【淘女郎】、【石像鬼】<br>4、发牌器新增《12人无目之夜》\
        V3.5更新日志（2025年1月28日）：<br>1、页面新增模块【发牌器】，现属于Beta公测版<br>2、手册版型新增《12人镜面对决》和《12人无尽轮回》<br>3、身份说明追加【镜匠】、【镜面狼】、【轮回师】、【轮回狼】、【高级平民】<br>4、手机登录首页会强制跳转到手机版首页<br>5、修改了【日光少女】、【月光少女】的技能描述\
        V3.0更新日志（2024年10月29日）：<br>1、页面新增模块【排位手册】<br>2、新增所有排位版型和《12人烈日逐光》和《12人侦探怪盗》<br>3、身份说明追加【蛊惑师】、【混血少年】、【狼之初恋】、【奇迹商人】、【怪盗狼王】、【黑市商人】、【狼兄】、【狼弟】、【吸血鬼骑士少女】、【数学家】和【悖论导师】\
        V2.2更新日志（2024年6月7日）：<br>1、修改了版型《12人爱神奇缘》<br>2、身份说明追加【爱神】<br>\
        V2.0更新日志（2024年5月31日）：<br>1、手册版型《12人无目之城》和《12人爱神奇缘》<br>2、身份说明追加【猎魔人】，【流光伯爵】，【蚀日侍女】，【狼鸦之爪】，【寂夜导师】,【摄梦人】，【狼巫】，【蚀时狼妃】<br> \
        V1.1更新日志（2024年5月6日）：<br>1、版型《12人催眠控制》进行了调整<br>2、身份说明追加【催眠师】<br>\
        V1.0更新日志（2024年4月16日）：<br>1、手册新增版型《12人催眠控制》和《12人自爆愚言家》<br>2、身份说明追加【催眠师】，【噩梦之影】，【日光少年】，【月光少女】，【愚言家】，【铁好人】");
})