$(() => {
    // 显示表格
    $(".block").click(() => $("#hide").css("display", "table"));
    // 关闭按钮
    $("#off").click(() => $("#hide").css("display", "none"));
    // 狼人阵营
    $("#wolf").click(() => {
        $("#hide>img").attr("src", "../../../image/id/wolf.jpg");
        $("#poor1").html("重点的保护目标，拼命地活下去，和其他玩家合作淘汰所有猎人");
        $("#poor2").html("可以认识自己的同伴，但是无法知道该同伴狼的品种");
        $("#poor3").html("你是重点的保护目标，你不能随意暴露自己");
    });
    $("#skinwolf").click(() => {
        $("#hide>img").attr("src", "../../../image/id/skinwolf.jpg");
        $("#poor1").html("重点的保护目标，拼命地活下去，和其他玩家合作淘汰所有猎人");
        $("#poor2").html("可以认识自己的同伴，猎人需要成功袭击你两次才会出局");
        $("#poor3").html("1、如果被公投，被女巫毒杀或猎人带杀时，即使第二条命没被触发，也会直接出局<br>2、你是重点的保护目标，你不能随意暴露自己");
    });
    $("#seer").click(() => {
        $("#hide>img").attr("src", "../../../image/id/seer.jpg");
        $("#poor1").html("本版型中属于狼人神职，胜利条件和狼人相同");
        $("#poor2").html("每天晚上查验一名玩家所属阵营");
        $("#poor3").html("1、预言家不能查验自己<br>2、不能查验已经翻牌的玩家和已经被查验的玩家<br>3、预言家可以空验，但不建议空验<br>4、由于此版型的特殊性，原来版型的【好人】会变为【狼人】<br>5、由于此版型的特殊性，原来版型的【狼人】会变为【猎人】");
    });
    $("#witch").click(() => {
        $("#hide>img").attr("src", "../../../image/id/witch.jpg");
        $("#poor1").html("本版型中属于狼人神职，胜利条件和狼人相同");
        $("#poor2").html("拥有一瓶解药和一瓶毒药：<br>解药可以救活当晚被袭击的玩家<br>毒药可以毒杀一名玩家");
        $("#poor3").html("1、每瓶药在一局游戏中只能使用一次<br>2、每晚只能使用一瓶药<br>3、女巫的解药一旦使用，女巫将失去查看今晚被袭击的玩家权利<br>4、女巫首夜是否能自救详见【版型说明】模块<br>5、女巫的毒药对于厚皮狼来说是致命的，请谨慎使用毒药");
    });
    $("#villager").click(() => {
        $("#hide>img").attr("src", "../../../image/id/villager.jpg");
        $("#poor1").html("沉着冷静的发言并分析，谨慎投出每一票，淘汰所有猎人");
        $("#poor2").html("无特殊技能");
        $("#poor3").html("必要时，你可选择欺骗猎人，混淆猎人的视听");
    });
    // 猎人阵营
    $("#hunter").click(()=>{
        $("#hide>img").attr("src","../../../image/id/hunter.jpg");
        $("#poor1").html("伪装成狼队阵营混淆视听，淘汰真正的狼人");
        $("#poor2").html("晚上跟随其他猎人一起参与袭击讨论，出局时可以带走玩家，如果被女巫毒杀或作为最后一张猎人牌出局则不能带走玩家");
        $("#poor3").html("1、本版型中你将与【预言家】【女巫】【平民】【狼人】和【厚皮狼】成为对立面<br>2、猎人因为公投出局的收益是最大的，尽量使用公投出局的机会带走厚皮狼")
    })
})
